% -------------------------------------------------------------------------
% 函数功能：矩阵的特征值分解，并按特征值升序排序
% -------------------------------------------------------------------------
% [输入]
% matrix：协方差矩阵
% [输出]
% newU：特征向量的矩阵，每列为一个特征向量
% newD：升序排列的特征值
% -------------------------------------------------------------------------
function [newU,newD] = EigSorted(matrix)
    [U,D] = eig(matrix);                          
    tempM = [diag( D )'; U];
    sortedAns = (sortrows(tempM', 1));
    newU = sortedAns( : , 2 : end )';
    newD = diag( sortedAns( : , 1 ) );
end